In [1]:
import pandas as pd

data = {
    'Name': ['Amit','Rani','Suresh','Priya','Karan','Neha'],
    'Age': [25, 30, 22, 28, 35, 27],
    'City': ['Hyderabad','Medchal','Karimnagar','Hyderabad','Warangal','Sangareddy'],
    'Salary': [35000, 42000, 28000, 39000, 46000, 30000]
}
df_sample = pd.DataFrame(data)
df_sample.to_csv('sample_data.csv', index=False)   
df_sample.head()

     Name  Age        City  Salary
0    Amit   25   Hyderabad   35000
1    Rani   30     Medchal   42000
2  Suresh   22  Karimnagar   28000
3   Priya   28   Hyderabad   39000
4   Karan   35    Warangal   46000

In [2]:
import pandas as pd

df = pd.read_csv('sample_data.csv')   # replace filename if using your own CSV

In [3]:
df.head()         # shows first 5 rows by default

     Name  Age        City  Salary
0    Amit   25   Hyderabad   35000
1    Rani   30     Medchal   42000
2  Suresh   22  Karimnagar   28000
3   Priya   28   Hyderabad   39000
4   Karan   35    Warangal   46000

In [4]:
df.head(3)

     Name  Age        City  Salary
0    Amit   25   Hyderabad   35000
1    Rani   30     Medchal   42000
2  Suresh   22  Karimnagar   28000

In [5]:
df.tail()         # last 5 rows
df.tail(2)        # last 2 rows

    Name  Age        City  Salary
4  Karan   35    Warangal   46000
5   Neha   27  Sangareddy   30000

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Age     6 non-null      int64
 2   City    6 non-null      object
 3   Salary  6 non-null      int64
dtypes: int64(2), object(2)
memory usage: 324.0+ bytes

In [7]:
df.describe()

             Age        Salary
count   6.000000      6.000000
mean   27.833333  36666.666667
std     4.445972   6976.149845
min    22.000000  28000.000000
25%    25.500000  31250.000000
50%    27.500000  37000.000000
75%    29.500000  41250.000000
max    35.000000  46000.000000

In [8]:
df.describe(include='all')

        Name        Age       City        Salary
count      6   6.000000          6      6.000000
unique     6        NaN          5           NaN
top     Amit        NaN  Hyderabad           NaN
freq       1        NaN          2           NaN
mean     NaN  27.833333        NaN  36666.666667
std      NaN   4.445972        NaN   6976.149845
min      NaN  22.000000        NaN  28000.000000
25%      NaN  25.500000        NaN  31250.000000
50%      NaN  27.500000        NaN  37000.000000
75%      NaN  29.500000        NaN  41250.000000
max      NaN  35.000000        NaN  46000.000000

In [9]:
df.columns      # index of column names
df.shape        # (rows, columns)

(6, 4)

In [10]:
df.dtypes

Name      object
Age        int64
City      object
Salary     int64
dtype: object

In [11]:
df.isnull().sum()

Name      0
Age       0
City      0
Salary    0
dtype: int64

In [12]:
import pandas as pd

# create sample
data = {'Name':['A','B','C','D','E'],
        'Age':[23,31,19,45,29],
        'Salary':[25000,40000,18000,60000,35000]}
df = pd.DataFrame(data)

# inspect
print("HEAD:\n", df.head(), "\n")
print("TAIL:\n", df.tail(), "\n")
print("INFO:")
df.info()
print("\nDESCRIBE:\n", df.describe())

HEAD:
   Name  Age  Salary
0    A   23   25000
1    B   31   40000
2    C   19   18000
3    D   45   60000
4    E   29   35000

TAIL:
   Name  Age  Salary
0    A   23   25000
1    B   31   40000
2    C   19   18000
3    D   45   60000
4    E   29   35000

INFO:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   Salary  5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 252.0+ bytes

DESCRIBE:
              Age        Salary
count   5.000000      5.000000
mean   29.400000  35600.000000
std     9.939819  16102.794788
min    19.000000  18000.000000
25%    23.000000  25000.000000
50%    29.000000  35000.000000
75%    31.000000  40000.000000
max    45.000000  60000.000000